artillery-200-loadtest-with-checks.yml
config:
  target: "https://bimbel.geniusedu.my.id"
  
  # Konfigurasi Plugin Expect untuk Functional Checks
  plugins:
    expect: {}

  # Menggunakan payload CSV untuk data login dinamis (dari hasil generate)
  payload:
    path: "siswa_data.csv"
    fields:
      - "email"
      - "password"
      - "ujian_id"
    order: sequence


  phases:
    - duration: 120
      arrivalRate: 2
      name: "Phase 1 - 200 Siswa Login & Mulai Ujian"

    - duration: 180
      arrivalRate: 15
      name: "Phase 2 - 200 Siswa Mengerjakan Ujian (Steady State)"

  defaults:
    headers:
      User-Agent: "Artillery-CBT-LoadTest/WithChecks"

scenarios:
    flow:
      # ==============================================================
      # STEP 1: Buka Halaman Login & Ambil CSRF Token
      # ==============================================================
      - get:
          url: "/login"
          capture:
            # Mengekstrak value dari <input type="hidden" name="_token" value="...">
            - regexp: "name=\"_token\" value=\"([^\"]+)\""
              as: "csrf_token"
          expect:
            - statusCode: 200

      - think: 2

      # ==============================================================
      # STEP 2: Login Siswa
      # ==============================================================
      - post:
          url: "/login"
          form:
            _token: "{{ csrf_token }}"
            email: "{{ email }}"
            password: "{{ password }}"
          expect:
            - statusCode: 302

      - think: 3

      # ==============================================================
      # STEP 2.5: Mulai Ujian (Mendapatkan Sesi ID)
      # ==============================================================
      - post:
          url: "/siswa/ujian/{{ ujian_id }}/mulai"
          form:
            _token: "{{ csrf_token }}"
          # Laravel akan me-redirect ke /siswa/ujian/{sesi_id}/soal/1
          # Kita tangkap URL redirect-nya untuk mengambil sesi_id
          capture:
            - header: "location"
              as: "redirect_url"
          expect:
            - statusCode: 302

      - think: 1

      # ==============================================================
      # STEP 3: Ambil Halaman Soal (URL didapat dari redirect)
      # ==============================================================
      - get:
          url: "{{ redirect_url }}"
          # Ekstrak sesi_id dari redirect url untuk endpoint submit & jawab
          capture:
            - regexp: "/siswa/ujian/([0-9]+)/"
              as: "sesi_id"
          expect:
            - statusCode: 200
            # TODO: Cek apakah HTML response mengandung kata kunci tertentu
            # - hasProperty: ... (Jika API berbentuk JSON)

      - think: 15

      # ==============================================================
      # STEP 4: Submit Jawaban (AJAX)
      # ==============================================================
      - post:
          url: "/siswa/ujian/{{ sesi_id }}/jawab"
          headers:
            "X-CSRF-TOKEN": "{{ csrf_token }}"
            "X-Requested-With": "XMLHttpRequest"
            "Accept": "application/json"
          form:
            _token: "{{ csrf_token }}"
            urutan: "1"
            # TODO: Sesuaikan dengan ID opsi yang valid di DB
            cbt_opsi_jawaban_id: "1" 
          capture:
            - json: "$.status"
              as: "response_status"
          expect:
            - statusCode: 200
            - contentType: "json"
            - equals:
                - "saved"
                - "{{ response_status }}"

      - think: 5

      # ==============================================================
      # STEP 5: Selesai Ujian / Submit Akhir
      # ==============================================================
      - post:
          url: "/siswa/ujian/{{ sesi_id }}/submit"
          form:
            _token: "{{ csrf_token }}"
          expect:
            # Redirect ke halaman hasil
            - statusCode: 302